# Напишите процедуру, которая выводит на экран
# запись переданного ей числа в римской системе счисления.
# Числа находятся в диапазоне [1, 3999]
# I - 1, V - 5, X - 10, L - 50, C  - 100, D - 500, M - 1000
# Пример:
# 2013
# MMXIII
n=int(input())
k1 = {1: 'I', 2: 'II', 3: 'III', 4: 'IV', 5: 'V',
     6: 'VI', 7: 'VII', 8: 'VIII', 9: 'IX', 0:''}
k2 = {10: 'X', 20: 'XX', 30: 'XXX', 40: 'XL',
     50: 'L', 60: 'LX', 70: 'LXX',
     80: 'LXXX', 90: 'XC', 0:''}
k3 = {100: 'C', 200: 'CC', 300: 'CCC',
     400: 'CD', 500: 'D', 600: 'DC',
     700: 'DCC', 800: 'DCCC', 900: 'CM', 0:''}
k4 = {1000: 'M', 2000:'M', 3000:'M', 0:''}
n1 = n % 10
n2 = n % 100 - n1
n3 = n % 1000 -n1 -n2
n4 = n%10000 - n1 - n2 -n3
print(k4.get(n4), k3.get(n3), k2.get(n2), k1.get(n1))



